# Напишіть функцію sumNum що задовільняє наступній умові:

# Дано ціле число num, 
# декілька кілька разів додайте всі його цифри, 
# доки в результаті не буде лише одна цифра, і поверніть її.

# Приклад 1
# sumNum(40) -> 4

# Для числа 40 потріботно повернути 4, чому?
# 1. 40 - розкладаємо на цифри -> 4, 0
# 2. Складаємо цифри 4 + 0 = 4
# 3. 4 - це одна цифра, повертаємо її

# Приклад 2
# sumNum(48) -> 3

# Для числа 48 потріботно повернути 3, чому?
# 1. 48 - розкладаємо на цифри -> 4, 8
# 2. Складаємо цифри 4 + 8 = 12
# 3. 12 - розкладаємо на цифри -> 1, 2
# 4. Складаємо цифри 1 + 2 = 3
# 5. 3 - це одна цифра, повертаємо її

# Приклад 3
# sumNum(2) -> 2

# Для числа 2 потріботно повернути 2, тому що число 2 складається з однієї цифри.


def sumNum(num):
    if (type(num) == int):
        if (num > 0): 
            NumStr =str(num)
            Dovgyna = len(NumStr)
            Sum = num
            while Dovgyna != 1:
                Sum = 0
                for element in NumStr:
                    Sum += int(element)
                NumStr =str(Sum)
                Dovgyna = len(NumStr)
            return Sum
        else:
            return "Помилка: Від'ємне число!"
    else:
        return "Помилка: неправильний тип аргументу!"
print('-38 ->', sumNum(-38)) 
print('"38"->', sumNum("38")) 
print('38 ->', sumNum(38)) 
print('40 ->', sumNum(40))
print('48 ->', sumNum(48)) 
print('2 ->', sumNum(2)) 