# Ініцілізовано функцію, напишіть в тілі функції логіку яка
# перевірить певне число на те чи воно парне або непарне.

# Функція приймає на вхід будь яке число і виводить в консоль строку типу 'Число Х є парним'.
# Наприклад:
#   oddOrEven(1) - > 'Число Х є непарним'
#   oddOrEven(20) - > 'Число Х є парним'
# Можна додавати свої тести за прикладом. Потрібно врахувати обробку можливих помилок.


def oddOrEven(num):
    if type(num) == int:
        print('\nАргумент ', num, 'є цілим числом')
        if (num % 2) == 1:
            print('Число ', num, 'є непарним')
        else:
            print('Число ', num, 'є парним')
    else:
        print('\nАргумент ', num, 'не є цілим числом')

oddOrEven(1)
oddOrEven(-2.5) # 'Число Х є непарним'
oddOrEven(20) # 'Число Х є парним'
oddOrEven('&&')
